const recipesAll = [
  {
    id: "125", // Унікальний ID для нового рецепта
    name: "Пісний борщ Полісся",
    description:
      "Традиційний вегетаріанський борщ з Полісся, відомий своїм насиченим смаком і простотою приготування.",
    ingredients: [
      { name: "буряк", quantity: 2, unit: "шт" },
      { name: "картопля", quantity: 3, unit: "шт" },
      { name: "морква", quantity: 0.5, unit: "шт" },
      { name: "цибуля", quantity: 1, unit: "шт" },
      { name: "квашена капуста", quantity: 200, unit: "г" },
      { name: "томатна паста", quantity: 2, unit: "ст.л." },
      { name: "мед", quantity: 2, unit: "ст.л." },
      { name: "вода", quantity: 2, unit: "л" },
    ],
    instructions: [
      {
        step: 1,
        description:
          "Спершу приготуйте відвар з двох буряків. Почистьте та розріжте навпіл коренеплід. Залийте його водою та відваріть 40 хв до готовності. Після продовжуйте варити далі, додавши ½ цибулини.",
      },
      {
        step: 2,
        description:
          "Наріжте 3-4 картоплини кубиками та пів моркви соломкою. Варіть їх разом з буряком.",
      },
      {
        step: 3,
        description:
          "Зробіть засмажку. Наріжте кубиками пів болгарського перцю та другу половину цибулі. Обсмажте 3-5 хвилин з невеликою кількістю рослинної олії. Додайте 2 ст. л. томатної пасти й протушкуйте ще 2-3 хвилини.",
      },
      {
        step: 4,
        description:
          "Дайте відвареному буряку охолонути та наріжте довільно. А потім разом з засмажкою відправте назад у відвар.",
      },
      {
        step: 5,
        description:
          "Коли всі овочі приготуються, додайте квашену капусту з 200 г розсолу. Проваріть 2-3 хвилини й додайте сіль, перець та 1-2 ст.л. меду.",
      },
      {
        step: 6,
        description:
          "Залиште настоюватися готовий борщ 15-20 хвилин або ж помістіть на цей час у духовку на 180 градусів.",
      },
      {
        step: 7,
        description:
          "Подавати краще на наступний день, щоб настоявся. Так кажуть у народі!",
      },
    ],
    image:
      "https://klopotenko.com/wp-content/uploads/2021/04/Borsh-getmanskiy_statia.jpg", // Додайте URL зображення
    categories: ["українська кухня", "вегетаріанські страви", "перші страви"],
    cookingTime: 90, // Приблизний час приготування
    notes: "Рекомендується настоювати перед подачею.",
  },
  {
    id: "124", // Новий унікальний ID
    name: "Олівє",
    description: "Класичний салат на Новий рік",
    ingredients: [
      { name: "римський салат", quantity: 1, unit: "головка" },
      { name: "куряче філе", quantity: 200, unit: "г" },
      { name: "хліб для сухариків", quantity: 4, unit: "скибки" },
      { name: "пармезан", quantity: 50, unit: "г" },
      { name: "помідори черрі", quantity: 100, unit: "г" },
      { name: "яйце", quantity: 1, unit: "шт" },
      { name: "анчоуси", quantity: 2 - 3, unit: "філе" },
      { name: "часник", quantity: 2, unit: "зубчики" },
      { name: "лимонний сік", quantity: 2, unit: "ст.л." },
      { name: "оливкова олія", quantity: 1 / 4, unit: "скл" },
      { name: "горчиця", quantity: "1 ч.л." },
      { name: "чорний перець", quantity: "за смаком" },
    ],
    instructions: [
      {
        step: 1,
        description:
          "Розігріти духовку до 180°C. Розрізати хліб на кубики, збризкати оливковою олією, посолити, поперчити та запекти до золотистої скоринки.",
      },
      {
        step: 2,
        description:
          "Приготувати соус Цезар: в блендері збити яйце, анчоуси, часник, лимонний сік, горчицю та оливкову олію до однорідної маси. Поступово додавати пармезан, постійно збиваючи.",
      },
      {
        step: 3,
        description:
          "Відварити куряче філе до готовності, нарізати невеликими шматочками.",
      },
      {
        step: 4,
        description: "Розділити римський салат на листя, викласти на тарілку.",
      },
      {
        step: 5,
        description:
          "Додати сухарики, курку, помідори черрі та полити соусом Цезар.",
      },
      { step: 6, description: "Посипати тертим пармезаном." },
    ],
    image:
      "https://images.unian.net/photos/2018_12/thumb_files/1000_545_1544783934-3964.jpg", // Додайте URL зображення
    categories: ["українська кухня", "вегетаріанські страви", "перші страви"],
    cookingTime: 90,
    notes: "Рекомендується настоювати перед подачею.",
  },

  // Новий об'єкт страви - Торт "Наполеон"
  {
    id: "129",
    name: 'Торт "Наполеон"',
    description:
      "Якщо ви запитаєте в себе, чого б хотілося на десерт, що вам перше прийде у голову? Звісно ж, торт! Навіть ті, хто не вважає себе шанувальником мучного та солодкого, куштували торти різних видів. Один з найбільш знаменитих своєю м’якістю та ніжністю смаку  це торт «Наполеон». Напевно, не дарма його назвали іменем великого генерала — загарбника мільйонів. Класичний торт «Наполеон» підкорив мільйони любителів солодкого, і ця перемога цілком та повністю заслужена.",
    ingredients: [
      // ... список інгредієнтів
    ],
    instructions: [
      // ... інструкції
    ],
    image: "https://rud.ua/uploads/recipe/56b30ed871f8a.jpg", // Додайте URL зображення
    categories: ["українська кухня", "вегетаріанські страви", "перші страви"],
    cookingTime: 90,
    notes: "Рекомендується настоювати перед подачею.",
  },

  // Новий об'єкт страви - Суші
  {
    id: "130",
    name: "Суші",
    description: "Японська страва з рису, риби та морепродуктів.",
    ingredients: [
      // ... список інгредієнтів
    ],
    instructions: [
      // ... інструкції
    ],
    // ... інші властивості
  },

  {
    id: "2130",
    name: "123",
    description: "Японська страва з рису, риби та морепродуктів.",
    ingredients: [
      // ... список інгредієнтів
    ],
    instructions: [
      // ... інструкції
    ],
    // ... інші властивості
  },
];

export default recipesAll;
