const recipesAll = [
  {
    id: '125', // Унікальний ID для нового рецепта
    name: 'Пісний борщ Полісся',
    description: 'Традиційний вегетаріанський борщ з Полісся, відомий своїм насиченим смаком і простотою приготування.',
    ingredients: [
      { name: 'буряк', quantity: 2, unit: 'шт' },
      { name: 'картопля', quantity: 3, unit: 'шт' },
      { name: 'морква', quantity: 0.5, unit: 'шт' },
      { name: 'цибуля', quantity: 1, unit: 'шт' },
      { name: 'квашена капуста', quantity: 200, unit: 'г' },
      { name: 'томатна паста', quantity: 2, unit: 'ст.л.' },
      { name: 'мед', quantity: 2, unit: 'ст.л.' },
      { name: 'вода', quantity: 2, unit: 'л' },
    ],
    instructions: [
      { step: 1, description: 'Спершу приготуйте відвар з двох буряків. Почистьте та розріжте навпіл коренеплід. Залийте його водою та відваріть 40 хв до готовності. Після продовжуйте варити далі, додавши ½ цибулини.'   
 },
      { step: 2, description: 'Наріжте 3-4 картоплини кубиками та пів моркви соломкою. Варіть їх разом з буряком.' },
      { step: 3, description: 'Зробіть засмажку. Наріжте кубиками пів болгарського перцю та другу половину цибулі. Обсмажте 3-5 хвилин з невеликою кількістю рослинної олії. Додайте 2 ст. л. томатної пасти й протушкуйте ще 2-3 хвилини.'   
 },
      { step: 4, description: 'Дайте відвареному буряку охолонути та наріжте довільно. А потім разом з засмажкою відправте назад у відвар.' },
      { step: 5, description: 'Коли всі овочі приготуються, додайте квашену капусту з 200 г розсолу. Проваріть 2-3 хвилини й додайте сіль, перець та 1-2 ст.л. меду.' },
      { step: 6, description: 'Залиште настоюватися готовий борщ 15-20 хвилин або ж помістіть на цей час у духовку на 180 градусів.' },
      { step: 7, description: 'Подавати краще на наступний день, щоб настоявся. Так кажуть у народі!' }
    ],
    image: 'https://klopotenko.com/wp-content/uploads/2021/04/Borsh-getmanskiy_statia.jpg', // Додайте URL зображення
    categories: ['українська кухня', 'вегетаріанські страви', 'перші страви'],
    cookingTime: 90, // Приблизний час приготування
    notes: 'Рекомендується настоювати перед подачею.'
  },
  {
    id: '124', // Новий унікальний ID
    name: 'Олівє',
    description: 'Класичний салат на Новий рік',
    ingredients: [
      // ... інгредієнти для салату Олів'є
    ],
    instructions: [
      // ... інструкції для салату Олів'є
    ],
    // ... інші поля
  }
];

export default recipesAll;
